In [1]:
'select * from table'

'select * from table'

In [5]:
var = '''select *
from table'''

In [8]:
print(var)

select *
from table

In [9]:
import pandas as pd


postgres_user = "dsbc_student"
postgres_pw = "7*.8G9QH21"
postgres_host = "142.93.121.174"
postgres_port = "5432"
postgres_db = "medicalcosts"

conn_str = f"postgresql://{postgres_user}:{postgres_pw}@{postgres_host}:{postgres_port}/{postgres_db}"

query = """
SELECT *
FROM medicalcosts
LIMIT 5000
"""

medical_costs = pd.read_sql_query(query, con=conn_str)
medical_costs.head(2)

   age     sex    bmi  children smoker     region   charges
0   19  female  27.90         0    yes  southwest  16884.90
1   18    male  33.77         1     no  southeast   1725.55